app/controllers/api/v1/carriers_controller.rb

SELECT  "carriers".* FROM "carriers" WHERE "carriers"."id" = ? LIMIT 1  [["id", 59]]
UPDATE "carriers" SET "latitude" = ?, "longitude" = ?, "altitude" = ?, "updated_at" = ? WHERE "carriers"."id" = ?  [["latitude", 99.9], ["longitude", 77.7], ["altitude", -88.8], ["updated_at", "2020-05-13 08:54:17.089749"], ["id", 59]]
---
    def tracking
        if params[:key].present? && params[:key] == "THISISAPIKEY"
            if params[:id].present? && params[:latitude].present? && params[:longitude].present? && params[:altitude].present?
                @carrier = Carrier.find(params[:id])
                @carrier.latitude = params[:latitude]
                @carrier.longitude = params[:longitude]
                @carrier.altitude = params[:altitude]

                if @carrier.save!

SELECT "carriers".* FROM "carriers" WHERE "carriers"."latitude" = ? AND "carriers"."longitude" = ?  [["latitude", 99.0], ["longitude", 77.0]]
---
    def by_coord
        @carriers = Carrier.all.where(latitude: params[:latitude], longitude: params[:longitude])