app/controllers/api/v1/transporters_controller.rb

  def index
    @transporters = Transporter.all
---
SELECT "transporters".* FROM "transporters"

    def set_transporter
      @transporter = Transporter.find(params[:id])
---
SELECT  "transporters".* FROM "transporters" WHERE "transporters"."id" = ? LIMIT 1  [["id", 0]]