app/controllers/api/v1/transporters_controller.rb

  def create
    if params[:key].present? && params[:key] == "THISISAPIKEY"
        if params[:name].present? && params[:siret].present? && params[:postal_codes].present? && params[:carriers].present?

            transp_name = params[:name]
            transp_siret = params[:siret]
            transp_postal_codes = params[:postal_codes]
            @carriers = params[:carriers]
            if Transporter.last.nil?
---
SELECT  "transporters".* FROM "transporters"  ORDER BY "transporters"."id" DESC LIMIT 1

                    @carrier.altitude = carrier[:altitude]
                end

                if @carrier.save!
---
INSERT INTO "carriers" ("name", "age", "has_driver_licence_b", "has_driver_licence_c", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Lucas"], ["age", 25], ["has_driver_licence_b", "f"], ["has_driver_licence_c", "t"], ["created_at", "2020-03-02 16:48:40.880803"], ["updated_at", "2020-03-02 16:48:40.880803"]]

                postal_codes: transp_postal_codes,
                carriers: @carriers
            )
            if @transporter.save!
---
INSERT INTO "transporters" ("name", "siret", "postal_codes") VALUES (?, ?, ?)  [["name", "nameTest"], ["siret", "SIRET123456"], ["postal_codes", "---\n- '02100'\n- '02230'\n"]]

  def get_carriers
      @transporter = Transporter.find(params[:id])
---
SELECT  "transporters".* FROM "transporters" WHERE "transporters"."id" = ? LIMIT 1  [["id", 1]]

  def by_postal_codes
      @transporters = Transporter.all.order(postal_codes: "ASC")
---
SELECT "transporters".* FROM "transporters"  ORDER BY "transporters"."postal_codes" DESC

  def by_carriers_passed_by
        @transporters = []
        @carriers = Carrier.where(latitude: params[:latitude], longitude: params[:longitude])

        @carriers.each do |carrier|
            @transporters.push(Transporter.find(carrier.transporter_id))
---
SELECT "carriers".* FROM "carriers" WHERE "carriers"."latitude" = ? AND "carriers"."longitude" = ?  [["latitude", 99.9], ["longitude", 77.7]]
SELECT "carriers".* FROM "carriers"
SELECT  "transporters".* FROM "transporters" WHERE "transporters"."id" = ? LIMIT 1  [["id", nil]]